DataProcessors/ТаблицаXML_ПланПоЦелевомуТрафику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>ТаблицаXML_ПланПоЦелевомуТрафику</Name>
			<Comment>Используется для ввода плана по целевому трафику в учетную политику в параметр "РостовВиктор_ПланПоЦелевомуТрафику", который используется в отчете выполнение плана по целевому трафику</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеИзмерения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЗ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаЦелевая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗначения</Name>
					<Comment>Тип значения строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ТаблицаXML_ПланПоЦелевомуТрафику/Ext/ObjectModule.bsl
Функция УстановитьНастройки() Экспорт
	
	Если Не ЗначениеЗаполнено(РегистрСведений) Тогда
		РегистрСведений 		= "УчетнаяПолитика";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Измерение) Тогда
		Измерение 			= "Параметр";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ресурс) Тогда
		Ресурс 				= "Значение";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено (ЗначениеИзмерения) Тогда
		ЗначениеИзмерения 	= "РостовВиктор_ПланПоЦелевомуТрафику";
	КонецЕсли;
КонецФункции

Функция ПолучиТекстИзРегистра()
	
	ЗначениеПоУмолчанию = "";
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Рег.Значение КАК Поле1
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика.СрезПоследних(&Период, ) КАК Рег
	|ГДЕ
	|	Рег.Параметр = &Измерение1";
	
	Если РегистрСведений <> "УчетнаяПолитика" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "УчетнаяПолитика", РегистрСведений);
	КонецЕсли;
	
	Если Измерение <> "Параметр" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Параметр", "Измерение");
	КонецЕсли;
	
	Если Ресурс <> "Значение" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Значение", "Ресурс");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период", 	ТекущаяДата());
	Запрос.УстановитьПараметр("Измерение1", ЗначениеИзмерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Рез = РезультатЗапроса.Выгрузить()[0][0];	
	Возврат Рез
	
КонецФункции

Функция ЗаписатьВУчетнуюПолитику(Период, Параметр, Значение)
	
	ЗначениеПоУмолчанию = Ложь;

	НЗ = РегистрыСведений.УчетнаяПолитика.СоздатьНаборЗаписей();
	НЗ.Отбор.Период.Установить(Период);
	НЗ.Отбор.Параметр.Установить(Параметр);
	НЗ.Прочитать();
	
	Новая = НЗ.Добавить();
	Новая.Период 			= Период;
	Новая.Параметр 			= Параметр;
	Новая.ТипЗначения 		= "Строка";
	Новая.Значение 			= Значение;
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		НЗ.Записать();
		Результат = Истина;
	Исключение
		Данные = "Период = "+Период+"; Параметр = "+Параметр+"; Значение = "+Значение;
		Комментарий = ОписаниеОшибки();
		ОбслуживаниеСервер.ЗарегистрироватьСобытие("Записать параметр учетной политики", УровеньЖурналаРегистрации.Ошибка, Данные, Комментарий,,,,ИмяКомпьютера());
		
		Результат = ЗначениеПоУмолчанию;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
КонецФункции

Процедура Сериализовать() Экспорт	
		
	Мас = Новый Массив();
	Для Каждого Зап Из ЭтотОбъект.ТЗ Цикл
		Структ = Новый Структура();
		Структ.Вставить("Месяц", 		Зап["Месяц"]);
		Структ.Вставить("ТочкаЦелевая", Зап["ТочкаЦелевая"]);
		Структ.Вставить("Количество", 	Зап["Количество"]);
		Мас.Добавить(Структ);
	КонецЦикла;
	
	
	ЗапXML = Новый ЗаписьXML();
	ЗапXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗапXML, Мас, НазначениеТипаXML.Явное);
	Стр = ЗапXML.Закрыть();

	ЗаписатьВУчетнуюПолитику(ТекущаяДата(), ЭтотОбъект.ЗначениеИзмерения, Стр);
	
КонецПроцедуры

Процедура Десериализовать() Экспорт
	
	ЭтотОбъект.ТЗ.Очистить();
	
	Стр = ПолучиТекстИзРегистра();
	
	ЧтXML = Новый ЧтениеXML();
	ЧтXML.УстановитьСтроку(Стр);
	Мас = СериализаторXDTO.ПрочитатьXML(ЧтXML);

	Для Каждого Эл Из Мас Цикл
		Новая = ЭтотОбъект.ТЗ.Добавить();
		
		Новая["Месяц"] = Эл["Месяц"];
		Новая["ТочкаЦелевая"] = Эл["ТочкаЦелевая"];
		Новая["Количество"] = Эл["Количество"];
	КонецЦикла;
	
	
КонецПроцедуры
